[errorMsg]

PCT_ERR_FAIL="خطأ غير معروف"

PCT_ERR_INVALUD_PARS="معلمة غير صالحة"

PCT_ERR_NOT_SURPPORT="غير معتمد"

PCT_ERR_OPEN_FILE_FAIL="فشل في فتح الملف"

PCT_ERR_NO_MEMORY="الذاكرة غير كافية"

PCT_ERR_READ_FILE="فشل في قراءة الملفe."

PCT_ERR_FILE_FORMAT="خطأ في تنسيق الملف"

PCT_ERR_NOMORE_ITEM="لا يوجد المزيد من الملفات"

PCT_ERR_FILE_PROCESS="فشل في معالجة الملف"

PCT_ERR_MEMORY_FAIL="خطأ في الذاكرة"

PCT_ERR_WRITE_FILE="فشل في كتابة الملف"

PCT_ERR_USER_CANCEL="تم إلغاء المستخدم"

PCT_ERR_NOT_INIT_FUN="غير مهيأ"

PCT_ERR_CREATE_THREAD="فشل في إنشاء موضوع"

PCT_ERR_DEVICE_NO_MORE_SPACE="مساحة قرص تخزين غير كافية"

PCT_ERR_DEVICE_FAIL="خطأ في الجهاز"

PCT_ERR_PATH_INVALID="مسار غير صالح"

PCT_ERR_CALL_API="فشل الاتصال"

PCT_ERR_FILE_NOT_EXIST="الملف غير موجود"

PCT_ERR_FILE_IN_USING="الملف قيد الاستخدام من قبل عملية أخرى."

PCT_ERR_REG_FAIL="خطأ في التسجيل"

PCT_ERR_NET_CONN="الشبكة غير متصلة أو غير متصلة"

PCT_ERR_LICENSE_OUTDATA="انتهت صلاحية رخصة"

PCT_ERR_NOT_SAME_VERSION="الإصدارات غير متناسقة."

PCT_ERR_NO_DISKSPACE="مساحة قرص تخزين غير كافية."

PCT_ERR_NTFS_MUST="NTFSفشل في نقل التطبيقات لأنها غير مثبتة على نظام ملفات."

PCT_ERR_INSTALL_APPX_FAILED="هذه التطبيقات غير متوافقة مع الكمبيوتر المستهدف. إعادة التثبيتمطلوب."

PCT_ERR_MOVE_APPX_FAILED="التطبيق غير متوافق مع نظام ملفات القسم الهدف."


